{
	"c_life_choices": "This song encourages the listener to make brave and conscious life choices and encourages them to not be held back by fear or the opinions of others. It also questions why they should be satisfied with being anything less than unique and why someone would not strive to be first in line.",
	"c_changing_world": "The song also gives the listener a sense of hope and perseverance, encouraging them to challenge conventional thinking and inspire positive change in order to achieve something better. It pushes the listener to go beyond what is expected of them and to be brave enough to make a difference in the world.",
	"c_overcoming_adversity": "The lyrics also push the listener to push through adversity and stay strong even when things are hard. It talks about not giving up and having courage to confront difficult times. It also talks about self-esteem and resilience and encourages the listener to not be deterred by other people's expectations and opinions.",
	"c_friendship": "The song suggests the listener to remain loyal and supportive to their friends and that it's important to raise your hand and make sure that people don't take advantage of you. It also hints at the idea of being there for each other and banding together in order to make the world a better place.",
	"c_love": "The song also touches upon the idea of love, suggesting that no matter how hard it gets, you should stay in it for the right reasons and be willing to fight for what you believe in. It hints at the idea of not giving up on love and not giving in to fear.",
	"c_finding_purpose": "The lyrics also present the idea of finding a purpose and the importance of it. It encourages the listener to search for something they can be passionate about and to not be discouraged by not being the first in line. It suggests gaining success in life through hard work and dedication, and encourages the listener to have faith in their ideas and dreams.",
	"c_loyalty": "The song also sings of loyalty and dedication. It suggests that no matter what situation life throws at them, the listener should remain loyal to themselves and to their friends.",
	"c_journeys": "The lyrics also talk about the journey of life and the importance of taking risks in order to follow your dreams. It speaks of life being a journey full of obstacles and hardships, but also full of joy and hope. It encourages the listener to see it through and to not be discouraged when things get tough.",
	"c_faith": "The lyrics also push the listener to have faith and to hold on to the hope that things will get better. It speaks of believing in something beyond what can be seen and trusting in a higher power.",
	"c_loss": "The lyrics evoke a sense of loss and longing, push the listener to reflect on past experiences and keep pushing forward. It talks of never giving up and of making the most of life, and encourages the listener to be brave and courageous in the face of life's challenges.",
	"sc_love": "The narrator is expressing their love for themselves and their self-esteem by standing up to people who try to limit them.",
	"sc_loss_and_longing": "The narrator longs for recognition and a deeper level of understanding from the people they care about.",
	"sc_memories": "The narrator reminisces on the times when they were looked down on by others and were not given the recognition they deserve.",
	"sc_coming_of_age": "The narrator is reflecting on their own self-development and strength as they try to carve out their own place in the world.",
	"sc_happiness_and_joy": "The narrator celebrates the progress they have made and the resilience of their spirit, expressing joy in their efforts and strength.",
	"sc_heartache_and_sadness": "The narrator expresses a sadness for the difficulties they have faced in life, but ultimately finds strength to push through their hardships.",
	"sc_intimacy_and_connection": "The narrator is calling out for a deeper understanding and connection with the people in their lives, emphasizing the importance of trust and vulnerability.",
	"sc_selfesteem_and_identity": "The narrator is striving to find confidence and assurance in their identity and worth despite the opinions of others.",
	"sc_hope_and_optimism": "The narrator finds hope in the journey they are taking and in the power of their own voice to make a difference.",
	"sc_fear_and_despair": "The narrator talks about the fears that stop them from speaking out and taking the steps they need to succeed.",
	"sc_redemption_and_reconciliation": "The narrator talks about finding redemption and the need for reconciling with those who have hurt them or misunderstood them.",
	"sc_social_justice_and_intervention": "The narrator calls out for justice, asking to be seen and respected for who they are without judgement or fear.",
	"sc_gratitude_and_appreciation": "The narrator expresses gratitude for the progress they have made and for having the courage to persist in the face of adversity.",
	"sc_rejection_and_abandonment": "The narrator reflects on the rejection and isolation they have faced and discusses the need for meaningful relationships with those around them.",
	"sc_longing_for_belongingness": "The narrator conveys their longing for a sense of belonging in the world, and for the connection and understanding of those around them.",
	"sc_creativity_and_expression": "The lyrics speak of creativity and expression as a way to find strength and courage to move forward.",
	"sc_hard_work_and_resilience": "The narrator acknowledges the hard work it takes to overcome obstacles and to be resilient in the face of adversity.",
	"sc_impermanence_and_interconnectedness": "The lyrics touch on the idea of interconnectedness and impermanence in the world, and the importance of appreciating each moment.",
	"sc_courage_and_resilience": "The narrator mentions courage and resilience and how it can be used to overcome difficulties and reach one's goals.",
	"sc_awe_and_wonder": "The lyrics convey a sense of awe and wonder at the beauty of nature and of life in general."
}